# vsoWidgetSetEnable

## Description
```pascal
PROCEDURE vsoWidgetSetEnable(
				widgetID : LONGINT;
				enabled  : BOOLEAN);
```

```python

def vs.vsoWidgetSetEnable(widgetID, enabled):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|enabled|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events